/* The title of the button for aborting the scanning of Audio Units. */
"Abort" = "Keskeytä";

/* alert button
   dialog confirmation */
"OK" = "OK";

/* alert button */
"Abort scan" = "Keskeytä skannaus";

/* alert button */
"Continue" = "Jatka";

/* alert button */
"Continue scan" = "Jatka skannausta";

/* alert button */
"Ignore" = "Älä huomioi";

/* alert button */
"Ignore plug-in" = "Ohita liitännäinen";

/* alert button */
"Open plug-in graphic interface" = "Avaa liitännäisen graafinen liittymä";

/* alert button */
"Start Plug-In Manager" = "Käynnistä liitännäisten hallinta";

/* alert text */
"Dear ^P user,\nyou have %ld Audio Unit(s) enabled which did not pass the Apple AU validation. This may cause problems and can even crash ^P or lead to data loss! Please check with the manufacturer(s) for updated versions. We recommend disabling these plug-ins in the Plug-In Manager." = "Arvoisa ohjelman ^P käyttäjä,\nsinulla on käytössä %ld Audio Unitia, jotka eivät ole läpäisseet Apple AU -validointia. Tämä voi aiheuttaa ongelmia tai jopa kaataa ohjelman ^P, tai johtaa tiedon häviämiseen! Tarkista, onko valmistajilla uusia versioita. Suosittelemme näiden liitännäisten poistamista käytöstä liitännäisten hallinnassa.";

/* alert text */
"Only Audio Units that have been successfully scanned will be available in ^P.\nScanning will continue next time you launch ^P." = "Vain onnistuneesti skannatut Audio Unitsit ovat saatavilla ohjelmassa ^P.\nSkannaus jatkuu, kun ^P avataan seuraavan kerran.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection." = "Valmistajan %2$@ Audio Unit ”%1$@” raportoi, että sitä ei ole valtuutettu käytettäväksi tässä järjestelmässä.\nKatso liitännäisen dokumentaatiosta lisätietoja liitännäisen kopiosuojauksesta.";

/* alert text */
"The Audio Unit “%@” by “%@” reports that it is not properly authorized to be used on this system.\nPlease check the plug-in’s documentation for more information about its copy protection. You may open the plug-in’s graphic interface now for managing copy protection." = "Valmistajan %2$@ Audio Unit ”%1$@” raportoi, että sitä ei ole valtuutettu käytettäväksi tässä järjestelmässä.\nKatso liitännäisen dokumentaatiosta lisätietoja liitännäisen kopiosuojauksesta. Voit nyt avata liitännäisen graafisen käyttöliittymän hallitaksesi sen kopiosuojausta.";

/* alert text */
"While verifying Audio Unit compatibility, ^P encountered %ld Audio Unit plug-in(s) which did not pass the Apple AU validation. These plug-ins have been excluded from further usage in ^P to prevent possible problems or crashes. You can start the Plug-In Manager now to review the validation results or continue the startup process." = "Kun ^P tarkasti ääniyksiköiden yhteensopivuutta, se kohtasi %ld ääniyksikköliitännäistä, jotka eivät läpäisseet Applen ääniyksiköiden tarkistusta. Ongelmien ja kaatumisten estämiseksi ^P lakkaa käyttämästä näitä liitännäisiä. Voit tarkistaa validointitulokset käynnistämällä liitännäisten hallinnan tai jatkaa käynnistystä.";

/* alert text */
"^P unexpectedly quit while trying to use the Audio Unit “%@” by “%@”.\nThis plug-in may require an update." = "^P lopetti yllättäen yrittäessään käyttää Audio Unitia ”%1$@” kohteessa ”%2$@”.\nTämä liitännäinen saattaa tarvita päivityksen.";

/* alert title */
"An error has occurred with an installed Audio Unit plug-in." = "Asennetun Audio Unit -liitännäisen kanssa tapahtui virhe..";

/* alert title */
"Audio Unit authorization error." = "Audio Unitin valtuutusvirhe.";

/* alert title */
"Incompatible Audio Units found." = "Löydettiin yhteensopimattomia Audio Unitseja.";

/* alert title */
"You are about to abort the scan process." = "Olet keskeyttämässä skannausta.";

/* alert title */
"You are using incompatible Audio Units." = "Käytössä on yhteensopimattomia Audio Unitseja.";

/* audio unit type */
"MIDI processor" = "MIDI-prosessori";

/* audio unit type */
"MIDI-controlled effect" = "MIDIn ohjaama tehoste";

/* audio unit type */
"effect" = "tehoste";

/* audio unit type */
"format converter" = "muodon muunnin";

/* audio unit type */
"generator" = "generaattori";

/* audio unit type */
"instrument" = "instrumentti";

/* audio unit type */
"mixer" = "mikseri";

/* audio unit type */
"offline effect" = "offline-äänitehoste";

/* audio unit type */
"output unit" = "lähtölaite";

/* audio unit type */
"panner" = "panoroija";

/* message while starting up */
"Searching for Audio Unit plug-ins…" = "Etsitään Audio Unit -liitännäisiä…";

/* message while starting up */
"Updating information about Audio Unit plug-ins…" = "Päivitetään tietoja Audio Unit -liitännäisistä…";

/* possible validation result */
"couldn’t be opened" = "ei voitu avata";

/* possible validation result */
"crashed validation" = "kaatoi validoinnin";

/* possible validation result */
"failed validation" = "ei läpäissyt validointia";

/* possible validation result */
"not authorized" = "ei valtuutettu";

/* possible validation result */
"not validated due to internal error" = "ei validoitu sisäisen virheen takia";

/* possible validation result */
"not yet validated" = "ei vielä validoitu";

/* possible validation result */
"successfully validated" = "validoitu onnistuneesti";

/* progress dialog text */
"Scanning Audio Units (finalized %d of %d)" = "Skannataan Audio Unitseja (valmiina %1$d / %2$d)";

/* progress dialog text */
"Scanning Audio Units (finalized %ld of %ld)" = "Skannataan Audio Unitseja (valmiina %1$ld / %2$ld)";

/* used for invalid version numbers */
"invalid" = "virheellinen";

/* used when value transformer can’t interpret given object */
"unknown" = "tuntematon";
